app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2016-08-20 17:06:30.446980"], ["id", 1]]
---
    def update
      @student = Student.find(params[:id])
      @student.update(first_name: student_params[:first_name], last_name: student_params[:last_name])